"%1$@ •••• %2$@" = "%1$@ •••• %2$@";

"+ Add" = "+ Προσθήκη";

"Add US bank account" = "Προσθήκη τραπεζικού λογαριασμού στις Ηνωμένες Πολιτείες";

"Add a card" = "Προσθήκη μιας κάρτας";

"Add a payment method" = "Προσθέστε μια μέθοδο πληρωμής";

"Add card" = "Προσθήκη κάρτας";

"Add new card" = "Προσθήκη νέας κάρτας";

"Add new payment method" = "Προσθέστε νέα μέθοδο πληρωμής";

"Add your payment information" = "Προσθέστε τα στοιχεία πληρωμής σας";

"Approve payment" = "Έγκριση πληρωμής";

"Back" = "Πίσω";

"Bank" = "Τράπεζα";

"Bank account" = "Τραπεζικός λογαριασμός";

"Buy now or pay later with <img/>" = "Αγορά τώρα ή πληρωμή αργότερα με <img/>";

"Buy now or pay later with Afterpay" = "Αγορά τώρα ή πληρωμή αργότερα με Afterpay";

"Buy now or pay later with Clearpay" = "Αγορά τώρα ή πληρωμή αργότερα με Clearpay";

"Buy now or pay later with Klarna" = "Αγορά τώρα ή πληρωμή αργότερα με Klarna";

"Buy using a UPI ID" = "Αγορά με χρήση αναγνωριστικού UPI";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Με την επιβεβαίωση της πληρωμής σας μέσω PayPal, επιτρέπετε στην %@ να χρεώσει τον λογαριασμό σας PayPal για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Αν συνεχίσετε στο Amazon Pay, επιτρέπετε στην %@ να χρεώνει τον λογαριασμό σας στο Amazon Pay για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Αν συνεχίσετε στην Klarna, επιτρέπετε στην %1$@ να χρεώνει τον λογαριασμό σας στην Klarna για μελλοντικές πληρωμές σύμφωνα με τους όρους της και τους όρους της Klarna. Μπορείτε να αλλάξετε αυτήν την επιλογή οποιαδήποτε στιγμή στην εφαρμογή Klarna ή επικοινωνώντας με την %2$@.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Εάν συνεχίσετε στο PayPal, επιτρέπετε στην %@ να χρεώσει τον λογαριασμό σας PayPal για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Αν συνεχίσετε στο Revolut Pay, επιτρέπετε στην %@ να χρεώνει τον λογαριασμό σας Revolut Pay για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Εάν συνεχίσετε, συμφωνείτε να εξουσιοδοτείτε πληρωμές με βάση <terms>αυτούς τους όρους</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Συνεχίζοντας, εξουσιοδοτείτε την %1$@ να χρεώσει τον λογαριασμό σας Cash App για αυτήν την πληρωμή και μελλοντικές πληρωμές σύμφωνα με τους όρους της %2$@, μέχρι να ανακληθεί αυτή η εξουσιοδότηση. Μπορείτε να αλλάξετε αυτήν την επιλογή οποιαδήποτε στιγμή στις ρυθμίσεις Cash App.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Με την εγγραφή σας στο Link, συμφωνείτε με τους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy>.";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Παρέχοντας τα στοιχεία του τραπεζικού λογαριασμού σας και επιβεβαιώνοντας αυτήν την πληρωμή, συμφωνείτε με το παρόν Αίτημα άμεσης χρέωσης και τη <terms>Σύμβαση παροχής υπηρεσιών Αιτήματος Άμεσης Χρέωσης</terms> και εξουσιοδοτείτε τη Stripe Payments Australia Pty Ltd, με εταιρικό αριθμό ACN 160 180 343 και Αναγνωριστικό αριθμό χρήστη άμεσης χρέωσης 507156 («Stripe») να χρεώνει τον λογαριασμό σας μέσω του Bulk Electronic Clearing System (BECS) εκ μέρους της %@ (ο «Έμπορος») για οποιαδήποτε ποσά, για τα οποία θα σας ενημερώνει χωριστά ο Έμπορος. Βεβαιώνετε ότι είστε δικαιούχος λογαριασμού ή εξουσιοδοτημένος υπογράφων για τον λογαριασμό που εμφανίζεται παραπάνω.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Με την παροχή των στοιχείων της κάρτας σας, επιτρέπετε στην %@ να χρεώνει την κάρτα σας για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Αν παράσχετε το email σας, συμφωνείτε να δημιουργηθεί ένας λογαριασμός στο Link και να αποθηκευτούν τα στοιχεία πληρωμής σας στο Link, σύμφωνα με τους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy> του Link.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Με την παροχή των στοιχείων πληρωμής σας και επιβεβαιώνοντας αυτήν την πληρωμή, εξουσιοδοτείτε (A) την %@ και την Stripe, τον πάροχο υπηρεσιών πληρωμών μας, να στείλουν οδηγίες στην τράπεζά σας προκειμένου να χρεώσει τον λογαριασμό σας και (B) την τράπεζά σας προκειμένου να χρεώσει τον λογαριασμό σας, σύμφωνα με τις οδηγίες αυτές. Στο πλαίσιο των δικαιωμάτων σας, δικαιούστε επιστροφή από την τράπεζά σας με βάση τους όρους και τις προϋποθέσεις που διατυπώνονται στη σύμβαση με την τράπεζά σας. Η αξίωση για επιστροφή πρέπει να υποβληθεί εντός 8 εβδομάδων από την ημερομηνία χρέωσης του λογαριασμού σας. Τα δικαιώματά σας επεξηγούνται σε αναλυτική κατάσταση, την οποία μπορείτε να εξασφαλίσετε από την τράπεζά σας. Συμφωνείτε να λαμβάνετε ειδοποιήσεις για μελλοντικές χρεώσεις έως και 2 ημέρες προτού προκύψουν.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Αν παράσχετε τον αριθμό τηλεφώνου σας, συμφωνείτε να δημιουργηθεί ένας λογαριασμός στο Link και να αποθηκευτούν τα στοιχεία πληρωμής σας στο Link, σύμφωνα με τους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy> του Link.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Αποθηκεύοντας τον τραπεζικό λογαριασμό σας για την %@, συμφωνείτε να εξουσιοδοτείτε πληρωμές σύμφωνα με <terms>αυτούς τους όρους</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Ακύρωση και πληρωμή με άλλον τρόπο";

"Choose a payment method" = "Επιλέξτε μέθοδο πληρωμής";

"Close card scanner" = "Κλείσιμο σαρωτή κάρτας";

"Confirm" = "Επιβεβαίωση";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Επιβεβαιώστε την πληρωμή στην εφαρμογή τράπεζας ή πληρωμής σας μέσα σε %@ για να ολοκληρώσετε την αγορά.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Επιβεβαιώστε την πληρωμή στην εφαρμογή της τράπεζάς σας μέσα σε %@ για την ολοκλήρωση της αγοράς.";

"Confirm your CVC" = "Επιβεβαιώστε τον κωδικό CVC";

"Contact information" = "Στοιχεία επικοινωνίας";

"EPS Bank" = "Τράπεζα με EPS";

"Enter address manually" = "Πληκτρολογήστε τη διεύθυνση";

"FPX Bank" = "FPX Bank";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Κατανοώ ότι η Stripe θα εισπράττει άμεσες χρεώσεις εκ μέρους της %@ και επιβεβαιώνω ότι είμαι ο δικαιούχος του λογαριασμού και το μόνο άτομο που απαιτείται για την έγκριση των χρεώσεων από αυτόν τον λογαριασμό.";

"IBAN" = "IBAN";

"Manage payment method" = "Διαχείριση μεθόδου πληρωμής";

"Manage payment methods" = "Διαχείριση μεθόδων πληρωμής";

"Manage your payment methods" = "Διαχειριστείτε τις μεθόδους πληρωμής σας";

"Name on card" = "Όνομα στην κάρτα";

"New card" = "Νέα κάρτα";

"New payment method" = "Νέα μέθοδος πληρωμής";

"Open your UPI app to approve your payment within %@" = "Ανοίξτε την εφαρμογή UPI για να εγκρίνετε την πληρωμή σας σε %@";

"Or" = "Ή";

"Or pay using" = "Ή πληρωμή χρησιμοποιώντας";

"Or pay with a card" = "Ή πληρωμή με κάρτα";

"Or use" = "Ή χρησιμοποιήστε";

"Or use a card" = "Ή χρησιμοποιήστε μια κάρτα";

"Pay %@" = "Πληρωμή %@";

"Pay another way" = "Πληρωμή με άλλον τρόπο";

"Pay faster at %@ and thousands of businesses." = "Ταχύτερες πληρωμές στην %@ και σε χιλιάδες επιχειρήσεις.";

"Pay over time with %@" = "Πληρωμή σταδιακά με %@";

"Pay over time with Affirm" = "Πληρωμή σταδιακά με Affirm";

"Pay with Link" = "Πληρωμή με το Link";

"Pay with your bank account in just a few steps." = "Πληρώστε με τον τραπεζικό λογαριασμό σας με λίγα μόνο βήματα.";

"Payment failed" = "Η πληρωμή απέτυχε";

"Please go back and select another payment method" = "Πηγαίνετε πίσω και επιλέξτε μια άλλη μέθοδο πληρωμής";

"Point the camera at your card." = "Στρέψτε την κάμερα στην κάρτα σας.";

"Processing..." = "Επεξεργασία…";

"Przelewy24 Bank" = "Τράπεζα Przelewy24";

"Remove card?" = "Αφαίρεση κάρτας;";

"Remove payment method" = "Αφαίρεση μεθόδου πληρωμής";

"Save" = "Αποθήκευση";

"Save a new payment method" = "Αποθήκευση νέας μεθόδου πληρωμής";

"Save address" = "Αποθήκευση διεύθυνσης";

"Save for future payments" = "Αποθήκευση για μελλοντικές πληρωμές";

"Save payment details to %@ for future purchases" = "Αποθήκευση στοιχείων πληρωμής στην %@ για μελλοντικές αγορές";

"Save this account for future %@ payments" = "Αποθηκεύστε αυτόν τον λογαριασμό για μελλοντικές %@ πληρωμές";

"Save your bank account in just a few steps." = "Αποθηκεύστε τον τραπεζικό λογαριασμό σας με λίγα μόνο βήματα.";

"Save your info for secure 1-click checkout with Link" = "Αποθήκευση των στοιχείων σας για ασφαλή ολοκλήρωση αγοράς με 1 κλικ μέσω Link";

"Saved" = "Αποθηκεύτηκε";

"Select card" = "Επιλέξτε κάρτα";

"Select payment method" = "Επιλέξτε μέθοδο πληρωμής";

"Select your payment method" = "Επιλέξτε τη μέθοδο πληρωμής σας";

"Set up" = "Διαμόρφωση";

"Shipping to %@ is not supported." = "Η αποστολή στη χώρα %@ δεν υποστηρίζεται.";

"Show menu" = "Εμφάνιση μενού";

"Simple, secure one-click payments" = "Απλές και ασφαλείς πληρωμές με ένα κλικ";

"Something went wrong when linking your account.\nPlease try again later." = "Παρουσιάστηκε κάποιο πρόβλημα κατά τη σύνδεση του λογαριασμού σας.\nΔοκιμάστε ξανά αργότερα.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Η Stripe θα καταθέσει 0,01 $ στον λογαριασμό σας σε 1-2 εργάσιμες ημέρες. Στη συνέχεια, θα λάβετε email με οδηγίες για να ολοκληρώσετε την αποθήκευση του τραπεζικού λογαριασμού σας με την %@.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Η Stripe θα καταθέσει 0,01 $ στον λογαριασμό σας σε 1-2 εργάσιμες ημέρες. Στη συνέχεια, θα λάβετε email με οδηγίες για να ολοκληρώσετε την πληρωμή στην %@.";

"The IBAN you entered is incomplete." = "Ο κωδικός IBAN που εισαγάγατε είναι ελλιπής.";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "Ο κωδικός IBAN που εισαγάγατε δεν είναι έγκυρος, ο κωδικός «%@» δεν είναι υποστηριζόμενος κωδικός χώρας.";

"Update" = "Ενημέρωση";

"Update card brand" = "Ενημέρωση επωνυμίας κάρτας";

"View more" = "Προβολή περισσότερων";

"Your IBAN should start with a two-letter country code." = "Ο κωδικός IBAN σας πρέπει να αρχίζει με έναν διψήφιο κωδικό χώρας.";

"iDEAL Bank" = "iDEAL Bank";
